In [2]:
import pandas as pd

In [4]:
# Utilizando os recursos aprendidos nesta aula, julgue o conjunto de operações de limpeza do DataFrame abaixo:
imoveis = pd.DataFrame(
    [
        ['Apartamento', None, 970, 68],
        ['Apartamento', 2000, 878, 112],
        ['Casa', 5000, None, 500],
        ['Apartamento', None, 1010, 170],
        ['Apartamento', 1500, 850, None],
        ['Casa', None, None, None],
        ['Apartamento', 2000, 878, None],
        ['Apartamento', 1550, None, 228],
        ['Apartamento', 2500, 880, 195]],
    columns=['Tipo', 'Valor', 'Condominio', 'IPTU'])

In [6]:
# 1) Elimina os registros que não apresentam a variável Valor:
imoveis.dropna(subset = ['Valor'], inplace = True)
imoveis

          Tipo   Valor  Condominio   IPTU
7  Apartamento  1550.0         NaN  228.0

In [5]:
# 2) Elimina os imóveis do tipo Apartamento que não apresentam valor Condominio:
selecao = (imoveis['Tipo'] == 'Apartamento') & (imoveis['Condominio'].isnull())
imoveis = imoveis[selecao]
imoveis

          Tipo   Valor  Condominio   IPTU
7  Apartamento  1550.0         NaN  228.0

In [7]:
# 3) Substitui os valores faltantes que restam nas variáveis Condominio e IPTU por zero:
imoveis = imoveis.fillna({'Condominio': 0, 'IPTU': 0})
imoveis

          Tipo   Valor  Condominio   IPTU
7  Apartamento  1550.0         0.0  228.0

In [8]:
# 4) Reconstrói o índice do DataFrame resultante:
imoveis.index = range(imoveis.shape[0])
imoveis

          Tipo   Valor  Condominio   IPTU
0  Apartamento  1550.0         0.0  228.0

As alternativas 1, 3 e 4 estão corretas.

In [9]:
# Suponha o seguinte conjunto de dados:
atletas = pd.DataFrame(
    [
        ['Marcos', 9.62], ['Pedro', None], ['João', 9.69],
        ['Beto', 9.72], ['Sandro', None], ['Denis', 9.69],
        ['Ary', None], ['Carlos', 9.74]],
    columns=['Corredor', 'Melhor Tempo']
)
atletas

  Corredor  Melhor Tempo
0   Marcos          9.62
1    Pedro           NaN
2     João          9.69
3     Beto          9.72
4   Sandro           NaN
5    Denis          9.69
6      Ary           NaN
7   Carlos          9.74

In [10]:
# Atribuir o tempo médio de todos os atletas aos dados faltantes.
atletas['Melhor Tempo'] = atletas['Melhor Tempo'].fillna(atletas['Melhor Tempo'].mean())

In [11]:
atletas

  Corredor  Melhor Tempo
0   Marcos         9.620
1    Pedro         9.692
2     João         9.690
3     Beto         9.720
4   Sandro         9.692
5    Denis         9.690
6      Ary         9.692
7   Carlos         9.740